a = int(input('Введено число: '))   # ставим int, чтобы сказать программе, что ожидаем целое число
b = int(input('Введено число: '))

if a == b:
    print(f'Вы ввели: {a} и {b}, числа равны')

elif a > b:
    print(f'Вы ввели: {a} и {b}, первое число больше второго')

else:
    print('Отработала секция else') # TODO дописать фразу для вывода


"""
Это многострочный комментарий,
здесь очень важная информация,

нужно писать его, если в этом
есть необходимость и не писать,
если необходимости нет. 

"""



