x = 17 / 2 * 3 + 3
y = 2 + 12 / 2 * 3
z = 19 % 4 + 15 / 2 * 3
a = (15 + 6) - 10 * 4
b = 17 / 2 % 2 * 3 ** 3


x2 = (17 / 2) * 3 + 3
y2 = 2 + (12 / 2) * 3
z2 = (19 % 4) + (15 / 2) * 3
a2 = 15 + 6 + (10 * 4)  # пример с ошибкой чтобы протестировать алгоритм (поменяла минус на плюс)
b2 = (17 / 2) % 2 * (3 ** 3)



if x == x2:
    print(x, ',', x2)
else:
    print('Ответ неверный')


if y == y2:
    print(y, ',', y2)
else:
    print('Ответ неверный')


if z == z2:
    print(z, ',', z2)
else:
    print('Ответ неверный')


if a == a2:
    print(a, ',', a2)
else:
    print('Ответ неверный')

if b == b2:
    print(b, ',', b2)
else:
    print('Ответ неверный')




